package by.htp.hometask02.main;
/* Составить программу сравнения двух чисел 1 и 2.Если 1 меньше 2 - вывести
 *  на экран слово "yes", в противном случае - слово "no".
 */
public class Task02 {

	public static void main(String[] args) {
	
		int x = 74;
		int y = 93;
		
		if( x < y) {
			System.out.println("yes");
		}
		else {
			System.out.println("no");
		}
	}

}
