package by.htp.hometask.main;

/* Дан прямоугольник, ширина которога в два раза меньше длины.
 * Найти площадь прямоугольника.
 */

public class Task07 {
	
	public static void main(String [] args) {
		
		int l = 18;
		int w = 9;
		
		int s = l * w;
		
		System.out.println("Площадь прямоугольника = "+s);
	}

}
